function solution(letter) {
    var answer = '';
    let morse = { 
    '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
    '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
    '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
    '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
    '-.--':'y','--..':'z'
}
    let s = letter.split(' ')       ///// letter의 문자열을 공백으로 쪼개고
       
    return s.map(function(m){       //// 쪼개진 문자열 s 를 맵객체에 넣고 변수 morse 에서 일치하는 밸류의 키값을 return 하도록                                     한다 //// 이후 join 메서드로 반환된 값을 붙혀준다
         return morse[m]
    }).join('');
}
